
/*!
@file ImpactCellMap.h
@brief ImpactCellMapなど
担当：丸山裕喜
*/

#pragma once
#include "stdafx.h"

namespace basecross {

	namespace maru {

		//--------------------------------------------------------------------------------------
		///	前方宣言
		//--------------------------------------------------------------------------------------
		class Cell;

		//--------------------------------------------------------------------------------------
		///	セルマップ
		//--------------------------------------------------------------------------------------
		class ImpactCellMap
		{
			std::vector<std::shared_ptr<Cell>> m_cells;	//セルマップのセル配列

		public:
			ImpactCellMap();

			//--------------------------------------------------------------------------------------
			///	アクセッサ
			//--------------------------------------------------------------------------------------

			void SetCells(const std::vector<std::shared_ptr<Cell>>& cells);

			std::vector<std::shared_ptr<Cell>> GetCells();
		};

	}

}