/*!
@file Freeze.h
@brief 時間停止対象
*/

#pragma once
#include "stdafx.h"

namespace basecross {
	//-----------------------------------------------------------------------------------------------
	/// 停止判定用コンポーネントクラス
	//-----------------------------------------------------------------------------------------------
	class Freeze : public Component
	{
	public:
		//-----------------------------------------------------------------------------------------------
		/// コンストラクタ
		Freeze(const std::shared_ptr<GameObject>& ptrObj)
			:Component(ptrObj)
		{}
		//-----------------------------------------------------------------------------------------------
		void OnLateStart() override
		{
			this->GetGameObject()->SetUpdateActive(false); // 自身が追加されているオブジェクトの更新を停止する
		}
		//-----------------------------------------------------------------------------------------------
	};
}