/*!
@file PolygonTexture.h
@brief 板ポリ表示
*/

#pragma once
#include "stdafx.h"

namespace basecross {
	//------------------------------------------------------------------------------------------------
	/// PolygonTextureを生成するときに渡すデータ構造体
	//------------------------------------------------------------------------------------------------
	struct UiData
	{
		wstring texture; //! 使用するテクスチャ 
		Vec3 position; //! ポリゴンの位置 
		Vec3 vertexPos; //! 頂点の幅 
		Vec2 scale; //! ポリゴンの大きさ 

		//-----------------------------------------------------------------------------------------------
		/**
		* @brief	コンストラクタ
		* @param[in] texture 使用するテクスチャ
		* @param[in] position ポリゴンの位置
		* @param[in] verTexPos 頂点の幅
		* @param[in] scale ポリゴンの大きさ
		*/
		UiData::UiData(const wstring& texture, const Vec3& position, const Vec3& vertexPos, const Vec2& scale)
			: texture(texture), position(position), vertexPos(vertexPos), scale(scale)
		{}
		//-----------------------------------------------------------------------------------------------
	};

	//------------------------------------------------------------------------------------------------
	/// テクスチャ付きの板ポリを生成するオブジェクトクラス
	//------------------------------------------------------------------------------------------------
	class PolygonTexture : public GameObject
	{
		UiData m_Data; //! 生成時のデータ 

	public:
		//-----------------------------------------------------------------------------------------------
		/**
		* @brief	コンストラクタ
		* @param[in] data 生成したいポリゴンのデータ
		*/
		PolygonTexture::PolygonTexture(const std::shared_ptr<Stage>& stage, UiData data)
			:GameObject(stage), m_Data(data)
		{}
		//-----------------------------------------------------------------------------------------------
		void OnCreate() override;
		//-----------------------------------------------------------------------------------------------

		//-----------------------------------------------------------------------------------------------
		// アクセッサ
		//-----------------------------------------------------------------------------------------------
		/// ポリゴンの頂点幅を取得 
		Vec3 GetVertexPosition() { return m_Data.vertexPos; }
		//-----------------------------------------------------------------------------------------------
	};
}
