/*!
@file SlimeRenderTarget.h
@brief SlimeRenderTargetなど
担当：丸山裕喜
*/

#pragma once
#include "stdafx.h"

namespace basecross {

	//--------------------------------------------------------------------------------------
	/// スライムのレンダーターゲット
	//--------------------------------------------------------------------------------------
	class SlimeRenderTarget : public RenderTarget
	{
	private:
		// pImplイディオム
		struct Impl;
		unique_ptr<Impl> pImpl;

	public:
		/// <summary>
		/// コンストラクタ
		/// </summary>
		/// <param name="slimeDrawDimension">表示寸法</param>
		explicit SlimeRenderTarget(float slimeDrawDimension = 4096.0f);

		/// <summary>
		/// デストラクタ
		/// </summary>
		virtual ~SlimeRenderTarget();

		//--------------------------------------------------------------------------------------
		/*!
		@brief	レンダリングターゲットビューを得る
		@return	レンダリングターゲットビューインターフェイスのポインタ
		*/
		//--------------------------------------------------------------------------------------
		ID3D11RenderTargetView* GetRenderTargetView() const;
		ID3D11ShaderResourceView* GetShaderResourceView() const;

		//--------------------------------------------------------------------------------------
		/*!
		@brief	デプスステンシルテクスチャを得る
		@return	デプスステンシルテクスチャインターフェイスのポインタ
		*/
		//--------------------------------------------------------------------------------------
		ID3D11Texture2D* GetDepthStencil() const;

		//--------------------------------------------------------------------------------------
		/*!
		@brief	デプスステンシルビューを得る
		@return	デプスステンシルビューインターフェイスのポインタ
		*/
		//--------------------------------------------------------------------------------------
		ID3D11DepthStencilView* GetDepthStencilView() const;

		//--------------------------------------------------------------------------------------
		/*!
		@brief	レンダリングターゲットをクリアする仮想関数（スクリーン全体をクリアする）
		@param[in]	col	クリア色
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void ClearViews(const bsm::Col4& col = bsm::Col4(0, 0, 0, 1.0f)) override;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	レンダリングターゲットを開始する
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void StartRenderTarget()override;
		//--------------------------------------------------------------------------------------
		/*!
		@brief	レンダリングターゲットを終了する
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void EndRenderTarget()override;
	};

}